app/controllers/admin_controller.rb

SELECT "users".* FROM "users"
---
	def admin
		# Admin page goes here, in the future
		@users = User.all