app/controllers/application_controller.rb

 	def map
	  # front page
		@map_settings = MapSetting.first
---
SELECT  "map_settings".* FROM "map_settings"   ORDER BY "map_settings"."id" ASC LIMIT 1

 	def admin_map
	  # add render statement

	   @users = User.all
	   @map_settings = MapSetting.first
---
SELECT "users".* FROM "users"
SELECT  "map_settings".* FROM "map_settings"   ORDER BY "map_settings"."id" ASC LIMIT 1