app/controllers/listings_controller.rb

INSERT INTO "listings" ("category_id", "created_at", "description", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 2], ["created_at", "2015-08-25 18:29:25.112170"], ["description", "testing"], ["price", 20.0], ["title", "Testing"], ["updated_at", "2015-08-25 18:29:25.112170"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save