app/controllers/map_settings_controller.rb

	def update
		respond_to do |format|

	    @map_setting = MapSetting.first
      if @map_setting.update(user_params)
---
SELECT  "map_settings".* FROM "map_settings"   ORDER BY "map_settings"."id" ASC LIMIT 1
UPDATE "map_settings" SET "hashtag" = $1, "updated_at" = $2 WHERE "map_settings"."id" = 207  [["hashtag", "kitten"], ["updated_at", "2015-09-01 23:12:09.383162"]]

    def set_map_setting
      @map_setting = MapSetting.find(params[:id])
---
SELECT  "map_settings".* FROM "map_settings"  WHERE "map_settings"."id" = $1 LIMIT 1  [["id", 207]]