app/controllers/pages_controller.rb

	def admin
		# Admin page goes here, in the future
		#@map_settings = MapSettings
		@users = User.all
---
SELECT "users".* FROM "users"

	def map
		@map_settings = MapSettings.create!(
			hashtag: '305',
			latitude: 25.7667,
			longitude: -80.2000
		)
---
INSERT INTO "map_settings" ("created_at", "hashtag", "latitude", "longitude", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-08-27 23:39:08.087377"], ["hashtag", "305"], ["latitude", "25.7667"], ["longitude", "-80.2"], ["updated_at", "2015-08-27 23:39:08.087377"]]