app/controllers/users_controller.rb

  def show
	  @users = User.all
	  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
	    @user = User.find(params[:id])
      if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "users" SET "crypted_password" = $1, "salt" = $2, "updated_at" = $3 WHERE "users"."id" = 7  [["crypted_password", "$2a$10$Adrd6FBOzy8pH8/J4zKAkeB8M1U.LP9JW.F6pKVUaAdsFrzHhaV6y"], ["salt", "yzhi2VULaLwWWXfXcg55"], ["updated_at", "2015-08-31 23:28:13.896670"]]